*** use clickhouse/org-brain tags to find similar terms/papers
:PROPERTIES:
:ID:       f64cff75-7387-4440-b41a-bb3d6fc7a932
:END:

search terms:
- [X] density
- [X] ecology
- [X] mortality
- [ ] survival: at Hanna_2010_partiality
- [ ] exit
- [ ] defection
- [ ] event-history


#+begin_src R
library(DBI)
library(collapse)

con <- DBI::dbConnect(RClickhouse::clickhouse(), host="localhost", db = "obvz")

cmd_bc <- "select * from bc"
cmd_bp <- "select * from bp"

## get both parent and child relations (unclear why there are separate tables, but whatever)
dt_bc <- qDT(dbGetQuery(con, cmd_bc))
dt_bp <- qDT(dbGetQuery(con, cmd_bp))

## generate brain links
dt_bl <- rbind(dt_bp[, .(child, parent)], dt_bc[, .(child, parent)]) %>% unique 
  
rel_terms1 <- .c(ecology, mortality, density)

## find papers that are good on relevant terms

## long-collapse version
sbt(dt_bl, parent %in% rel_terms1) %>% gby(child) %>% smr(cnt = len(child)) %>% sbt(cnt >= 2)

## more compact collapse
dt_rel_papers <- sbt(dt_bl, parent %in% rel_terms1) %>% fcount(child) %>% sbt(N >= 2)

## even more compact collapse possible? doubt it: different steps
## sbt(dt_bl, parent %in% rel_terms1 & fcount(parent, child) > 2)

## dt still most compact 
dt_bl[parent %in% rel_terms1, .N, child][N >= 2]

## tags they they use
dt_bl[dt_rel_papers[, .(child)], .(parent), on = "child"] %>% fcount(parent) %>% roworder(-N) %>%
  sbt(parent %!in% rel_terms1) %>% sbt(1:20)


## find papers that have similar tags to papers high on relevant terms
dt_other_papers <- dt_bl[dt_rel_papers[, .(child)], .(parent), on = "child"] %>% funique %>% 
  dt_bl[., on = "parent"] %>% .[!dt_rel_papers, on = "child"]

## tags that other papers use
dt_other_papers %>% fcount(parent) %>% roworder(-N) %>% sbt(1:20)

## print the papers with the largest absolute overlap
dt_other_papers %>% fcount(child) %>% roworder(-N) %>% sbt(1:30)
  
  
#+end_src

#+RESULTS:
| Porac_Ventresca_Mishina_2017_cognition | 29 |
| Hsu_2005_forms                         | 27 |
| Peltoniemi_2014_cultural               | 23 |
| Fligstein_2015_fields                  | 23 |
| Rossman_2012_climbing                  | 22 |
| King_Pearce_2010_contentiousness       | 20 |
| Porac_1990_taxonomic                   | 20 |
| Kirschbaum_2017_jazz                   | 20 |
| Bourdieu_1993_production               | 19 |
| Abrahamson_1999_fashion                | 18 |
| Friedland_1991_symbols                 | 18 |
| Rao_1994_reputation                    | 17 |
| Maclean_etal_2021_philanthropy         | 17 |
| Fligstein_2002_markets                 | 17 |
| Cousin_Chauvin_2021_bourgeoisie        | 17 |
| Powell_1991_introduction               | 16 |
| Berwick_Christia_2018_capacity         | 16 |
| Hsu_2006_jacks                         | 16 |
| Hsu_2015_granted                       | 16 |
| Kackovic_etal_2020_quality             | 16 |
| Piazzai_concepts                       | 15 |
| Lena_2019_entitled                     | 15 |
| Lizardo_2009_comparative               | 15 |
| Fligstein_1991_transformation          | 15 |
| Gnyp_2015_collectors                   | 15 |
| Boone_2012_uneveness                   | 15 |
| Brown_2019_private                     | 15 |
| KohlArenas_2015_selfhelp               | 15 |
| Lena_2008_classification               | 14 |
| KalbCosmo_2020_museum                  | 14 |

-> this really seems to be all kind of things.. 


